# 16-1
#  旧金山 ：
# 旧金山的气温更接近于锡特卡还是死亡谷呢？
# 请绘制一个显示旧金山最高气温和最低气温的图表，并进行比较。
# 可从http://www.wunderground.com/history/# 下载几乎任何地方的天气数据。
# 为此，请输入相应的地方和日期范围，滚动到页面底部，找到名为Comma-Delimited File的链接，再单击该链接，将数据存储为CSV文件。

# 16-2
# 比较锡特卡和死亡谷的气温 ：
# 在有关锡特卡和死亡谷的图表中，气温刻度反映了数据范围的不同。
# 为准确地比较锡特卡和死亡谷的气温范围，需要在y 轴上使用相同的刻度。
# 为此，请修改图16-5和图16-6所示图表的y 轴设置，对锡特卡和死亡谷的气温范围进行直接比较（你也可以对任何两个地方的气温范围进行比较）。
# 你# 还可以尝试在一个图表中呈现这两个数据集。

# 16-3
#  降雨量 ：
# 选择你感兴趣的任何地方，通过可视化将其降雨量呈现出来。
# 为此，可先只涵盖一个月的数据，确定代码正确无误后，再使用一整年的数据来运行它。

# 16-4
# 探索 ：
# 生成一些图表，对你好奇的任何地方的其他天气数据进行研究。